# Pandas Week 1

# 1.Prefix & Suffix

In [17]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [18]:
#Data Frame Prep
n_rows= 5
n_cols=5
cols= tuple('ABCDE')
df=pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)),
                columns=cols)
df

   A  B  C  D  E
0  7  6  4  3  6
1  8  8  8  3  3
2  2  9  6  9  3
3  2  7  3  1  7
4  9  2  6  9  7

In [19]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [21]:
#prefix: menambahkan sebuah karakter atau kata di depan semua nama kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        7        6        4        3        6
1        8        8        8        3        3
2        2        9        6        9        3
3        2        7        3        1        7
4        9        2        6        9        7

In [20]:
#suffix: menambahkan sebuah karakter atau kata di belakang semua nama kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        7        6        4        3        6
1        8        8        8        3        3
2        2        9        6        9        3
3        2        7        3        1        7
4        9        2        6        9        7

# 2.Row Selection

In [7]:
#import modules
import pandas as pd
import numpy as np 

#cek Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [43]:
#Data Frame prep
r_rows= 10
r_cols=5
cols= tuple('ABCDE')
sf=pd.DataFrame(np.random.randint(1, 5, size=(r_rows,r_cols)),
                columns=cols)
sf

   A  B  C  D  E
0  4  3  4  4  1
1  1  3  4  2  2
2  3  1  3  4  1
3  3  3  1  3  4
4  1  3  3  4  2
5  3  1  3  2  1
6  2  4  1  4  3
7  3  1  4  2  3
8  1  3  1  1  2
9  2  4  2  1  1

# Selection dengan operator logika | (or)

In [44]:
sf[(sf['A']==1)| (sf['A']==3)] #memilih kolom A yang nilainya 1 dan 3

   A  B  C  D  E
1  1  3  4  2  2
2  3  1  3  4  1
3  3  3  1  3  4
4  1  3  3  4  2
5  3  1  3  2  1
7  3  1  4  2  3
8  1  3  1  1  2

# Selection dengan fungsi isin()

In [45]:
sf[sf['A'].isin([1,3])]

   A  B  C  D  E
1  1  3  4  2  2
2  3  1  3  4  1
3  3  3  1  3  4
4  1  3  3  4  2
5  3  1  3  2  1
7  3  1  4  2  3
8  1  3  1  1  2

# Operator negasi ~

In [46]:
sf[~sf['A'].isin([1,3])] #nilai"yg kolom A yang bukan 1 atau 3

   A  B  C  D  E
0  4  3  4  4  1
6  2  4  1  4  3
9  2  4  2  1  1

# 3 Konversi tipe data String ke Numerik

In [47]:
#import modules
import pandas as pd
import numpy as np 

#cek Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [48]:
#Data Frame prep
data = {'cols1':['1','2','3','teks'], 
        'cols2':['1','2','3','4']}
kf=pd.DataFrame(data)
kf

#col1 kolom pertama
#col2 kolom kedua

  cols1 cols2
0     1     1
1     2     2
2     3     3
3  teks     4

In [49]:
kf.dtypes 
#dtypes: mengecek tipe data yang ada di semua kolom

cols1    object
cols2    object
dtype: object

# Konversi tipe data dengan fungsi astype()

In [50]:
kf_x=kf.astype({'cols2':'float'}) #mengkonversi data pada suatu kolom ke tipe data lain (jika dikolom tersebut ada String maka akan terjadi error karena String bukan tipe data numerik )
kf_x

  cols1  cols2
0     1    1.0
1     2    2.0
2     3    3.0
3  teks    4.0

In [51]:
kf_x.dtypes

cols1     object
cols2    float64
dtype: object

# Konversi data numerik dengan menggunkan fungsi to_numeric()

In [52]:
kf.apply(pd.to_numeric, errors='coerce')
#coerce digunakan bila ada tipe 
#kata yang memang kita tidak konversikan 
#ke numeric sehingga data tersebut akan digantikakn dengan NaN 
#NaN= Not a Number (bisa juga dianggap sebagai missing value)

   cols1  cols2
0    1.0      1
1    2.0      2
2    3.0      3
3    NaN      4

# 4 Columns Selection

In [53]:
#import modules
import pandas as pd
import numpy as np 

#cek Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [68]:
c_rows=5
c_cols=2
cols=['bil_pecahan', 'bil_bulat']

cf=pd.DataFrame(np.random.randint(1,20, size=(c_rows, c_cols)),
               columns=cols)
cf['bil_pecahan'] = cf['bil_pecahan'].astype('float')

cf.index=pd.util.testing.makeDateIndex(c_rows, freq='H')
#pd.util.testing.makeDateIndex digunakan untuk membuat index dengan tipe data date time
#freq: inteval antar data (disini intervalnya satu jam sekali)

cf=cf.reset_index()
#men-genearte index baru yang berupa index integer dari 0 s/d 4 sehingga kolom index dipandang sebgai kolom biasa

cf['teks'] = list('ABCDE')
#menambah kolom baru (teks)

cf

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          3.0          1    A
1 2000-01-01 01:00:00          9.0          3    B
2 2000-01-01 02:00:00          9.0         11    C
3 2000-01-01 03:00:00          9.0         15    D
4 2000-01-01 04:00:00          5.0         10    E

In [69]:
cf.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih kolom dengan tipe data numerik

In [52]:
cf.select_dtypes(include='number')#hanya memilih kolom yang tipe data numerik

   bil_pecahan  bil_bulat
0         16.0          7
1         14.0          9
2          1.0          2
3          3.0          4
4         13.0          3

In [53]:
cf.select_dtypes(include='float')#hanya memilih kolom yang tipe datanya float

   bil_pecahan
0         16.0
1         14.0
2          1.0
3          3.0
4         13.0

In [54]:
cf.select_dtypes(include='int')#hanya memilih kolom yang tipe datanya int

   bil_bulat
0          7
1          9
2          2
3          4
4          3

# Memilih Kolom dengan tipe data Object atau String

In [55]:
cf.select_dtypes(include='object')#hanya memilih kolom yang tipe datanya Object (String dipandang sebagi Object)

  teks
0    A
1    B
2    C
3    D
4    E

In [70]:
cf.select_dtypes(include='datetime')#hanya memilih kolom yang tipe datanya datetime

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

# Memilih kolom dengan banyak kombinasi tipe data

In [1]:
cf.select_dtypes(include=['number','object'])
#Parameter includenya diganti dengan tipe data list agar bisa memuat semua tipe data yang ingin dimunculkan

SyntaxError: unexpected EOF while parsing (<ipython-input-1-d8962780cd0e>, line 2)

Source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5